In [1]:
import pandas as pd
data_frame = pd.read_csv("data.csv")
data_frame.shape

(17660, 29)

In [2]:
data_frame.describe()

,ID,Age,Overall,Potential,Special,International Reputation,Weak Foot,Skill Moves,Kit Number
count,17660.000000,17660.000000,17660.000000,17660.000000,17660.000000,17660.000000,17660.000000,17660.000000,17625.000000
mean,246319.424462,23.127746,63.369592,70.981200,1537.915855,1.106285,2.900340,2.297169,25.037957
std,31487.892861,4.639821,8.036268,6.529836,285.893809,0.407021,0.663523,0.754264,19.154116
min,16.000000,15.000000,43.000000,42.000000,749.000000,1.000000,1.000000,1.000000,1.000000
25%,240732.500000,20.000000,58.000000,67.000000,1387.000000,1.000000,3.000000,2.000000,11.000000
50%,257041.000000,22.000000,63.000000,71.000000,1548.000000,1.000000,3.000000,2.000000,22.000000
75%,263027.500000,26.000000,69.000000,75.000000,1727.000000,1.000000,3.000000,3.000000,32.000000
max,271340.000000,54.000000,91.000000,95.000000,2312.000000,5.000000,5.000000,5.000000,99.000000

In [3]:
data_frame.values

array([[209658, 'L. Goretzka', 27, ..., '€157M', 8.0, nan],
       [212198, 'Bruno Fernandes', 27, ..., '€155M', 8.0, nan],
       [224334, 'M. Acuña', 30, ..., '€97.7M', 19.0, nan],
       ...,
       [270567, 'A. Demir', 25, ..., '€142K', 12.0, nan],
       [256624, '21\xa0S. Czajor', 18, ..., '€214K', 40.0, nan],
       [256376, '21\xa0F. Jakobsson', 20, ..., '€131K', 30.0, nan]],
      dtype=object)

In [6]:
df1 = pd.DataFrame(data_frame, columns=["Name", "Wage", "Value"])

def value_to_float(x):
    if type(x) is float or type(x) is int:
        return x
    if 'K' in x:
        if len(x) > 1:
            return float(x.replace('K', '')) * 1000
        return 1000.0
    if 'M' in x:
        if len(x) > 1:
            return float(x.replace('M', '')) * 1000000
        return 1000000.0
    if 'B' in x:
        return float(x.replace('B', '')) * 1000000000
    return 0.0

wage = df1["Wage"].replace("[\€]", "", regex=True).apply(value_to_float)
value = df1["Value"].replace("[\€]", "", regex=True).apply(value_to_float)

df1["Wage"] =wage
df1["Value"] = value

df1["difference"] = df1["Value"] - df1["Wage"]
df1

                  Name      Wage        Value   difference
0          L. Goretzka  115000.0   91000000.0   90885000.0
1      Bruno Fernandes  190000.0   78500000.0   78310000.0
2             M. Acuña   46000.0   46500000.0   46454000.0
3         K. De Bruyne  350000.0  107500000.0  107150000.0
4           N. Barella  110000.0   89500000.0   89390000.0
...                ...       ...          ...          ...
17655    Deng Xiongtao       0.0     100000.0     100000.0
17656   22 Lim Jun Sub       0.0     100000.0     100000.0
17657         A. Demir    2000.0      70000.0      68000.0
17658     21 S. Czajor       0.0      90000.0      90000.0
17659  21 F. Jakobsson       0.0      90000.0      90000.0

[17660 rows x 4 columns]